apple-open-source/macos/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI.cpp
	}
	
    // Initialize the Root Hub registers
    if (_errataBits & kErrataDisableOvercurrent)
        _pOHCIRegisters->hcRhDescriptorA |= HostToUSBLong(kOHCIHcRhDescriptorA_NOCP);
        
    // <rdar://problem/5981624> we used to also initialize the Root Hub Status register here. However, the bus might be in
    // operational state reset at this time, so some OHCI implementations may not allow us to write
    // to it, so we will do that after we make the bus state operational instead
    
	return kIOReturnSuccess;
}


void 		
AppleUSBOHCI::stop( IOService * provider )
{
	USBLog(5, "AppleUSBOHCI[%p]::stop - isInactive(%s) - hcCommandStatus(%p)", this, isInactive() ? "true" : "false", (void*)USBToHostLong(_pOHCIRegisters->hcCommandStatus));
	super::stop(provider);
}


bool		
AppleUSBOHCI::willTerminate(IOService * provider, IOOptionBits options)
{
	USBLog(5, "AppleUSBOHCI[%p]::willTerminate - isInactive(%s) - hcCommandStatus(%p)", this, isInactive() ? "true" : "false", (void*)USBToHostLong(_pOHCIRegisters->hcCommandStatus));
	return super::willTerminate(provider, options);
}



bool		
AppleUSBOHCI::didTerminate( IOService * provider, IOOptionBits options, bool * defer )
{
	USBLog(5, "AppleUSBOHCI[%p]::didTerminate - isInactive(%s) - hcCommandStatus(%p)", this, isInactive() ? "true" : "false", (void*)USBToHostLong(_pOHCIRegisters->hcCommandStatus));
	return super::didTerminate(provider, options, defer);
}


IOReturn 
AppleUSBOHCI::UIMInitialize(IOService * provider)
{
    IOReturn				err = kIOReturnSuccess;
    UInt32					lvalue;
    IOPhysicalAddress		hcDoneHead;
	IODMACommand *			dmaCommand = NULL;
	bool					hccaBufferPrepared = false;
	char *					logicalBytes;
	UInt64					offset = 0;
	IODMACommand::Segment32	segments;
	UInt32					numSegments = 1;
    IOPhysicalAddress		pPhysical= 0;
	
    USBLog(5,"AppleUSBOHCI[%p]::UIMInitialize", this);
	
	// the old do while false loop to prevent goto statements
	do
	{
		if (!_uimInitialized) 
		{
			_device = OSDynamicCast(IOPCIDevice, provider);
			if (_device == NULL)
			{
				err = kIOReturnBadArgument;
				break;
			}
			
			SetVendorInfo();
			
			/*
			 * Initialize my data and the hardware
			 */
			_errataBits = GetErrataBits(_vendorID, _deviceID, _revisionID);

			if (_v3ExpansionData->_onThunderbolt || (_errataBits & kErrataDontUseCompanionController))
			{
				USBLog(3, "AppleUSBOHCI[%p]::UIMInitialize - Thunderbolt and companion controllers disallowed. Not initializing", this);
				err =  kIOReturnUnsupported;
				break;
			}

			// set up MMIO
			_deviceBase = provider->mapDeviceMemoryWithIndex(0);
			if (!_deviceBase)
			{
				USBError(1,"AppleUSBOHCI[%p]::UIMInitialize unable to get device memory", this);
				err = kIOReturnNoMemory;
				break;
			}
			
			USBLog(3, "AppleUSBOHCI[%p]::UIMInitialize config @ %x (%x)", this, (uint32_t)_deviceBase->getVirtualAddress(), (uint32_t)_deviceBase->getPhysicalAddress());
			
			// Set up a filter interrupt source (this process both primary (thru filter function) and secondary (thru action function)
			// interrupts.
			//
			_filterInterruptSource = IOFilterInterruptEventSource::filterInterruptEventSource(this, AppleUSBOHCI::InterruptHandler,	 AppleUSBOHCI::PrimaryInterruptFilter, provider );
			
			if ( !_filterInterruptSource )
			{
				USBError(1,"AppleUSBOHCI[%p]::UIMInitialize unable to get filterInterruptEventSource", this);
				err = kIOReturnBadArgument;
				break;
			}
			
			err = _workLoop->addEventSource(_filterInterruptSource);
			if ( err != kIOReturnSuccess )
			{
				USBError(1,"AppleUSBOHCI[%p]::UIMInitialize unable to add filter event source: 0x%x", this, err);
				err = kIOReturnBadArgument;
				break;
			}
			
			setProperty("Errata", _errataBits, 32);
			
			if (_errataBits & kErrataLucentSuspendResume)
			{
				OSData	*suspendProp;
				UInt32	portBitmap = 0;
				
				// We need to check to see if there are ports that we really should suspend
				//
				suspendProp     = OSDynamicCast(OSData, provider->getProperty( "AAPL,SuspendablePorts" ));
				if (suspendProp)
				{
					// Only allow suspend on certain ports
					//
					portBitmap = *((UInt32 *) suspendProp->getBytesNoCopy());
					_disablePortsBitmap = (0xffffffff & (~portBitmap));
				}
				else
					_disablePortsBitmap = (0xffffffff);
			}
			
			USBLog(5,"AppleUSBOHCI[%p]::UIMInitialize errata bits=0x%x", this, (uint32_t) _errataBits);
			
			_pOHCIRegisters = (OHCIRegistersPtr) _deviceBase->getVirtualAddress();
			
			// leave bus mastering off until we get the setPowerState
			_device->configWrite16(kIOPCIConfigCommand, kIOPCICommandMemorySpace);
			
			// Set up HCCA.
			
			// Use IODMACommand to get the physical address
			dmaCommand = IODMACommand::withSpecification(kIODMACommandOutputHost32, 32, PAGE_SIZE, (IODMACommand::MappingOptions)(IODMACommand::kMapped | IODMACommand::kIterateOnly));
			if (!dmaCommand)
			{
				USBError(1, "AppleUSBOHCI[%p]::UIMInitialize - could not create IODMACommand", this);
				err = kIOReturnInternalError;
				break;
			}
			USBLog(5, "AppleUSBOHCI[%p]::UIMInitialize - got IODMACommand %p", this, dmaCommand);
			
			//
			_hccaBuffer = IOBufferMemoryDescriptor::inTaskWithPhysicalMask(kernel_task, kIOMemoryUnshared | kIODirectionInOut | kIOMemoryPhysicallyContiguous, kHCCAsize, kOHCIStructureAllocationPhysicalMask);
			if (_hccaBuffer == NULL) 
			{
				USBError(1, "AppleUSBOHCI[%p]::UIMInitialize - could not get HCCA buffer", this);
				err = kIOReturnNoMemory;
				break;
			}
			
			err = _hccaBuffer->prepare();
			if (err)
			{
				USBError(1, "AppleUSBOHCI[%p]::UIMInitialize - _hccaBuffer->prepare failed with status(%p)", this, (void*)err);
				break;
			}
			
			hccaBufferPrepared = true;
			
			err = dmaCommand->setMemoryDescriptor(_hccaBuffer);
			if (err)
			{
				USBError(1, "AppleUSBOHCI[%p]::UIMInitialize - setMemoryDescriptor returned err (%p)", this, (void*)err);
				break;
			}
			
			offset = 0;
			segments.fIOVMAddr = 0;
			segments.fLength = 0;
			numSegments = 1;
			
			err = dmaCommand->gen32IOVMSegments(&offset, &segments, &numSegments);
			if (err || (numSegments != 1) || (segments.fLength != kHCCAsize))
			{
				USBError(1, "AppleUSBOHCI[%p]::UIMInitialize - could not generate segments err (%p) numSegments (%d) fLength (%d)", this, (void*)err, (int)numSegments, (int)segments.fLength);
				dmaCommand->clearMemoryDescriptor();
				err = err ? err : kIOReturnInternalError;
				break;
			}
			
			_pHCCA = (Ptr)_hccaBuffer->getBytesNoCopy();
			_hccaPhysAddr = segments.fIOVMAddr;
			
			USBLog(5, "AppleUSBOHCI[%p]::UIMInitialize - HCCA Buffer pPhysical[%p] logical[%p]", this, (void*)_hccaPhysAddr, _pHCCA);
			
			dmaCommand->clearMemoryDescriptor();
			
			// Release the DMA Command
			if (dmaCommand)
			{
				if (dmaCommand->getMemoryDescriptor())
				{
					USBError(1, "AppleUSBOHCI[%p]::UIMInitialize - dmaCommand still has memory descriptor (%p)", this, dmaCommand->getMemoryDescriptor());
					dmaCommand->clearMemoryDescriptor();
				}
				dmaCommand->release();
				dmaCommand = NULL;
			}
			
			_rootHubFuncAddress = 1;
			
			// set up Interrupt transfer tree
			if ((err = IsochronousInitialize()))	break;
			if ((err = InterruptInitialize()))		break;
			if ((err = BulkInitialize()))			break;
			if ((err = ControlInitialize()))		break;
			
			// <rdar://problem/5981624> this will be done in the setPowerState
			// InitializeOperationalRegisters();
			
			// Work around the Philips part which does weird things when a device is plugged in at boot
			//
			if (_errataBits & kErrataNeedsPortPowerOff)
			{
				USBError(1, "AppleUSBOHCI[%p]::UIMInitialize error, turning off power to ports to clear", this);
				OHCIRootHubPower(0 /* kOff */);
				// No need to turn the power back on here, the reset does that anyway.
			}
			
			// Just so we all start from the same place, reset the OHCI.
			_pOHCIRegisters->hcControl = HostToUSBLong ((kOHCIFunctionalState_Reset << kOHCIHcControl_HCFSPhase));
			IOSync();
			
			// always make sure we stay in reset for at least 50 ms
			IOSleep(50);
			
			// leave the controller in reset until we get the setPowerState
			
			if (_errataBits & kErrataLSHSOpti)
				OptiLSHSFix();
			
			CheckSleepCapability();
		}
		_uimInitialized = true;
		_myBusState = kUSBBusStateReset;
		
	} while (false);
	

	if ( kIOReturnSuccess != err )
	{
		if (_hccaBuffer)
		{
			if (hccaBufferPrepared)
				_hccaBuffer->complete();
			_hccaBuffer->release();
			_hccaBuffer = NULL;
		}
		
